{
  "backend/main.mo": "Main Motoko actor defining all data types (UserProfile, InventoryItem, Challan, Payment, PettyCash, Client) and in-memory maps for storage, with access control, user approval, blob storage mixins, and CRUD operations for inventory, challans, payments, petty cash, and client management.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: removing BackendConnectionGate component wrapper from App.tsx router configuration (REQ-1) and deleting the unused BackendConnectionGate.tsx component file (REQ-2).",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including pages, components, hooks, and utilities, describing their functionality, data flow, and key features like authentication, mutation gating, bulk uploads, and error handling.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment verification guide with build/deploy commands, critical inventory add item test flow, troubleshooting steps, and documentation of in-app diagnostics features including Build Info panel, connection error handling, and runtime diagnostics reporting.",
  "frontend/index.css": "Empty CSS file with no content.",
  "frontend/index.html": "HTML entry point with CSP meta tag allowing connections to IC domains, RENTIQ title, and script tag loading main.tsx module.",
  "frontend/src/App.tsx": "Root application component defining TanStack Router configuration with AuthApprovalGate wrapping all routes (dashboard, inventory, challans, payments, petty cash, client balances, reports, access management), AppErrorBoundary for error handling, and runtime diagnostics initialization.",
  "frontend/src/components/challans/ChallanBulkUploadDialog.tsx": "Dialog component for bulk uploading challans from CSV files with file parsing, validation against existing challans, staff restriction checks, error display, and upload result reporting showing success count and failures.",
  "frontend/src/components/challans/ChallanEditDialog.tsx": "Dialog component for editing existing challans with form validation, inventory quantity checks, and support for updating client, venue, dates, freight, site, and line items.",
  "frontend/src/components/challans/ChallanFormDialog.tsx": "Dialog component for creating new challans with form inputs for client, venue, dates, freight, site, and multiple line items with real-time inventory availability validation.",
  "frontend/src/components/challans/ChallanNewFormatBulkUploadDialog.tsx": "Dialog for bulk uploading challans via CSV in a new format, with CSV parsing, validation, staff permission checks, and batch creation with success/failure reporting.",
  "frontend/src/components/challans/ChallanRestoreDatesDialog.tsx": "Dialog for restoring challan rent and return dates from an original CSV file, supporting both legacy and new formats with staff permission restrictions.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV with template download, CSV parsing, duplicate detection, and batch creation with detailed error reporting.",
  "frontend/src/components/common/AppErrorBoundary.tsx": "React error boundary component that catches render-time errors and displays a fallback UI with expandable technical details, diagnostics report copying, and a reset button to reload the application.",
  "frontend/src/components/common/ApprovalRequiredScreen.tsx": "Full-page screen for authenticated but unapproved users that displays approval status, allows requesting access, and provides sign-out functionality with automatic status refresh.",
  "frontend/src/components/common/AuthApprovalGate.tsx": "Global authentication and approval gate that manages Internet Identity login flow, admin bootstrap on admin domains, and conditionally renders sign-in, approval, or main app content based on authentication and approval status.",
  "frontend/src/components/common/BackendConnectionGate.tsx": "Empty file with no content.",
  "frontend/src/components/common/BuildInfo.tsx": "Sheet component that displays build metadata, backend connection diagnostics, real-time health monitoring, manual connection/auth testing, and provides access to detailed diagnostics reports.",
  "frontend/src/components/common/BulkUploadUX.tsx": "Collection of reusable UI components for bulk upload workflows including steps display, validation buttons, template download, preview sections with error/success alerts, and scrollable error lists.",
  "frontend/src/components/common/DiagnosticsReportDialog.tsx": "Dialog component that displays a formatted diagnostics report in a read-only textarea with copy-to-clipboard and clear log functionality.",
  "frontend/src/components/common/ModalSelectContent.tsx": "Wrapper around SelectContent that ensures proper scrolling, z-index handling, and collision detection when select dropdowns are used inside modal dialogs.",
  "frontend/src/components/common/QueryErrorState.tsx": "Reusable error state component for query failures that displays classified error messages, collapsible troubleshooting steps, technical details, and action buttons for retry or sign-in based on error type.",
  "frontend/src/components/common/SignInRequiredDialog.tsx": "Modal dialog that prompts users to sign in with Internet Identity, includes retry mechanism with attempt tracking, displays login errors, and shows troubleshooting tips after multiple failed attempts.",
  "frontend/src/components/common/SignInScreen.tsx": "Full-page authentication screen with Internet Identity login, diagnostic information capture, domain-aware messaging (admin vs staff portal), and detailed error logging with troubleshooting guidance for authentication failures.",
  "frontend/src/components/inventory/InventoryBulkUploadDialog.tsx": "Dialog for bulk uploading inventory items via CSV file with template download, CSV parsing with validation, error reporting per row, staff permission checks, and batch creation with success/failure tracking.",
  "frontend/src/components/inventory/InventoryFormDialog.tsx": "Dialog form for creating or editing individual inventory items with validation, duplicate name checking, mutation gating for authentication/authorization, and sign-in prompt on unauthorized access.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, sidebar navigation, and footer; displays mode badges (admin/staff), conditionally shows access management for admins, and skips layout rendering for print routes.",
  "frontend/src/components/payments/PaymentBulkUploadDialog.tsx": "Dialog component for bulk uploading payments via CSV file, with validation, error display, and staff permission checks using useStaffRestrictions hook.",
  "frontend/src/components/payments/PaymentFormDialog.tsx": "Dialog form component for adding individual payment records with fields for ID, date, client, mode, amount, reference number, and site.",
  "frontend/src/components/petty-cash/PettyCashAttachmentsSection.tsx": "Component for uploading, displaying, and removing file attachments (images and PDFs) for petty cash records using ExternalBlob storage.",
  "frontend/src/components/petty-cash/PettyCashBulkUploadDialog.tsx": "Dialog component for bulk uploading petty cash records via CSV file with validation, error handling, and staff permission checks.",
  "frontend/src/components/petty-cash/PettyCashFormDialog.tsx": "Dialog form for creating/editing petty cash records with fields for balances, expenses, categories, and integration with attachments section and PDF generation.",
  "frontend/src/hooks/useAccessManagement.ts": "React Query hooks for admin access management including checking admin status, listing user approvals, and setting approval statuses.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useActorWithConnection.ts": "Provides enhanced actor connection management with health probes, exponential backoff retry logic, connection state tracking, timeout handling, and comprehensive diagnostics for monitoring backend connectivity.",
  "frontend/src/hooks/useAppMode.ts": "Detects whether the app is running on the admin domain (containing '-x18') or staff domain based on hostname, providing mode flags for conditional UI/behavior.",
  "frontend/src/hooks/useApprovalStatus.ts": "Provides queries to check if the current caller is approved or an admin, with periodic refetching for automatic access updates, plus a mutation to request approval.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Mutation hook to bootstrap the first admin user on the admin domain, calling becomeBootstrapAdmin and invalidating admin/approval queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flows, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useMutationGate.ts": "Guards mutations by checking actor readiness and authentication state, returning detailed status messages based on connection stage for user feedback.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks for CRUD operations on inventory, challans, payments, petty cash, clients, user profiles, and build metadata, including bulk operations and dashboard metrics calculations.",
  "frontend/src/hooks/useQueryDataVersion.ts": "Derives a serializable version string from React Query cache metadata (dataUpdatedAt) to enable derived queries to recompute without including BigInt data in queryKeys.",
  "frontend/src/hooks/useStaffRestrictions.ts": "Combines app mode and admin role to determine if the current user can perform bulk upload and delete actions, restricting staff mode users to admins only.",
  "frontend/src/hooks/useTodayKey.ts": "Returns a stable per-day key (YYYY-MM-DD) that automatically updates at midnight, used to trigger date-aware React Query invalidation and recomputation.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light/dark theme colors using OKLCH color space. Includes comprehensive modal/dialog opacity fixes with high-specificity selectors to ensure Radix UI dialogs render with fully opaque backgrounds.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/AccessManagementPage.tsx": "Admin-only page for managing user access approvals, displaying pending requests and approved users. Includes functionality to approve/deny users with permission checks and loading states.",
  "frontend/src/pages/ChallanDetailPage.tsx": "Displays detailed view of a single challan with edit, delete, and print actions. Implements staff restrictions and prevents modifications to returned challans with lock indicators.",
  "frontend/src/pages/ChallanPrintPage.tsx": "Print-optimized page for displaying challan details including company header, client info, items table, and totals. Auto-triggers browser print dialog on load.",
  "frontend/src/pages/ChallansPage.tsx": "Main challans listing page with table view, create/bulk upload dialogs, and mark-as-returned functionality. Implements authentication gates, staff restrictions, and error handling with toast notifications.",
  "frontend/src/pages/ClientBalancesPage.tsx": "Displays a table of client balances showing total rent, payments, outstanding amounts, and advances. Uses useClientBalances hook to fetch data and formats currency values with color-coded outstanding (red) and advance (green) amounts.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page showing daily, monthly, and all-time metrics including revenue, challan counts, payments, expenses, and inventory status. Uses useInventory and useDashboardMetrics hooks to fetch and display key business metrics in card layouts with icons.",
  "frontend/src/pages/InventoryPage.tsx": "Manages inventory items with add, edit, and bulk upload functionality. Implements staff restrictions and authentication checks using useMutationGate and useStaffRestrictions hooks, displaying items in a table with edit actions.",
  "frontend/src/pages/PaymentsPage.tsx": "Displays and manages payment records with add and bulk upload capabilities. Shows payments in a table with date, client, payment mode (with color-coded badges), amount, and reference number columns.",
  "frontend/src/pages/PettyCashPage.tsx": "Tracks daily petty cash transactions showing opening balance, cash from MD, expenses, staff advances, handover to MD, and closing balance. Includes PDF download functionality and bulk upload support with staff restrictions.",
  "frontend/src/pages/ReportsPage.tsx": "Comprehensive reporting page with daily, monthly, all-time, and custom date range reports. Provides filtering by client, site, and status, with Excel export functionality for challans, payments, and petty cash data.",
  "frontend/src/utils/challanExportTemplate.ts": "Builds Excel export data for challans with item-level detail rows, repeating challan-level fields (ID, client, venue, dates, freight, total, status) for each item in the challan.",
  "frontend/src/utils/challanImport.ts": "Parses legacy CSV format for challan imports with one row per item, validating required fields (Challan ID, Client Name, Item Name, Quantity, Rate, Start/End Dates, Freight) and grouping items by challan ID.",
  "frontend/src/utils/challanImportNewFormat.ts": "Parses new CSV format for challan imports with one row per challan, supporting multiple items in a single 'Items' column using either parentheses format (ItemName(qtyxratexdays)) or colon format (ItemName:qty:rate).",
  "frontend/src/utils/challanRestoreImport.ts": "Parses CSV files for restoring challan dates, supporting both legacy (Start Date/End Date) and new (Rent Date/Return Date) formats, validating date ranges and creating minimal Challan objects for date restoration.",
  "frontend/src/utils/challanTotals.ts": "Provides shared calculation utilities for challan totals, including item total (quantity × rate × rental days), challan total (items total + freight), and form-based calculations for create/edit dialogs.",
  "frontend/src/utils/clientImport.ts": "Parses and validates client CSV imports with simple name-only format, checking for duplicates against existing clients and within the upload file, handling quoted values.",
  "frontend/src/utils/csv.ts": "General-purpose CSV parser that handles standard quoting rules, escaped quotes, multi-line quoted fields, UTF-8 BOM, and CRLF line endings, returning structured headers and rows.",
  "frontend/src/utils/dashboardMetrics.ts": "Calculates dashboard metrics (revenue, payments, expenses, cash in hand) for given time periods, filtering challans by rent date and payments by creation date, with separate logic for future metrics.",
  "frontend/src/utils/dates.ts": "Provides date utility functions for converting between JavaScript Date objects and bigint nanosecond timestamps, including parsing, normalization, and rental day calculations.",
  "frontend/src/utils/diagnosticsReport.ts": "Generates comprehensive diagnostics reports tracking authentication events, backend connection probes, response times, and browser capabilities for troubleshooting.",
  "frontend/src/utils/errors.ts": "Classifies and normalizes errors into categories (actor-unavailable, authorization, network, timeout, etc.) with troubleshooting guidance for each error type.",
  "frontend/src/utils/exportToCSV.ts": "Provides functions to download CSV templates for inventory, challans, payments, petty cash, and clients with predefined headers.",
  "frontend/src/utils/exportToExcel.ts": "Exports report data (challans, payments, petty cash, client balances, summary) to Excel format using dynamically loaded SheetJS library with multiple worksheets.",
  "frontend/src/utils/paymentImport.ts": "Parses and validates CSV files for payment imports, checking for duplicate IDs, validating date formats, amounts, and required fields, then converts valid rows into Payment objects.",
  "frontend/src/utils/pettyCashImport.ts": "Parses and validates petty cash CSV imports with required columns (date, opening balance, cash from MD, expenses, etc.), checks for duplicate dates, validates numeric fields, and parses category expenses.",
  "frontend/src/utils/pettyCashPdf.ts": "Generates PDF documents for petty cash records using pdf-lib loaded from CDN, creating formatted tables with opening/closing balances, transactions, and remarks.",
  "frontend/src/utils/reportExportFormatters.ts": "Provides shared Excel export formatting utilities including date conversion from nanosecond timestamps, currency formatting, text normalization, and short date formatting for reports.",
  "frontend/src/utils/runtimeDiagnostics.ts": "Comprehensive runtime diagnostics system tracking authentication lifecycle, actor initialization, connection probes, and errors with context capture, persisting logs to sessionStorage for troubleshooting deployment and authentication failures.",
  "frontend/src/utils/safeSerialize.ts": "Safe serialization helpers that prevent BigInt serialization errors by converting BigInt to strings, providing safe error detail extraction and logging utilities.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both query strings and hash-based routing, with sessionStorage persistence for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including container, border radius, shadows, and accordion animations, with typography, container queries, and animate plugins.",
  "project_state.json": "Project state metadata for RentIQ Udaipur rental application tracking a fix request to remove the BackendConnectionGate component that blocks dashboard access, with two completed features for removing the component wrapper and file."
}