{
  "backend/main.mo": "Main backend actor implementing inventory, challans, payments, petty cash, and client management with access control, user approval, blob storage mixins, and bootstrap admin functionality.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to debugging and fixing Internet Identity authorization page blank screen issues across admin and production modes.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and utilities with focus on authentication, authorization, data management, and error handling.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment verification checklist with build/deploy commands, critical inventory add item test flow, and detailed in-app diagnostics instructions for troubleshooting connection and actor initialization issues.",
  "frontend/index.css": "Empty CSS file with no content.",
  "frontend/index.html": "HTML entry point with CSP meta tag allowing Internet Identity domains (identity.ic0.app, id.ai) for authentication iframe/popup integration.",
  "frontend/src/App.tsx": "Root application component initializing runtime diagnostics and setting up router with BackendConnectionGate and AuthApprovalGate wrapping all routes including dashboard, inventory, challans, payments, petty cash, client balances, reports, and access management.",
  "frontend/src/components/challans/ChallanBulkUploadDialog.tsx": "Dialog component for bulk uploading challans from CSV with file parsing, validation against existing challans, staff permission checks, error reporting, and upload results display.",
  "frontend/src/components/challans/ChallanEditDialog.tsx": "Dialog component for editing existing challans with form validation, inventory quantity checks, and support for updating client, venue, dates, items, and freight details.",
  "frontend/src/components/challans/ChallanFormDialog.tsx": "Dialog component for creating new challans with dynamic item rows, inventory availability validation, and automatic calculation of rental days and totals.",
  "frontend/src/components/challans/ChallanNewFormatBulkUploadDialog.tsx": "Dialog for bulk uploading challans via CSV in a new format, with CSV parsing, validation, staff permission checks, and detailed success/failure reporting.",
  "frontend/src/components/challans/ChallanRestoreDatesDialog.tsx": "Dialog for restoring challan rent and return dates from original CSV files, supporting both legacy and new formats with staff permission restrictions.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV with template download, duplicate detection, parsing validation, and batch creation with error reporting.",
  "frontend/src/components/common/AppErrorBoundary.tsx": "React error boundary component that catches render-time errors and displays a fallback UI with expandable technical details and a 'Copy Diagnostics' button for deployment verification.",
  "frontend/src/components/common/ApprovalRequiredScreen.tsx": "Full-page screen for authenticated but unapproved users, showing approval status with request access and sign-out actions, automatically refreshing approval status until granted.",
  "frontend/src/components/common/AuthApprovalGate.tsx": "Global authentication and approval gate that manages Internet Identity initialization, domain-aware bootstrap flow for admin users, and comprehensive error handling for authentication failures.",
  "frontend/src/components/common/BackendConnectionGate.tsx": "Global gate component with fast connectivity probe and bounded-time initialization that shows progressive status messages and allows in-app retry without page reload.",
  "frontend/src/components/common/BuildInfo.tsx": "Build info panel displaying Internet Identity diagnostics, manual authentication test button, browser compatibility checks, and comprehensive troubleshooting guidance for blank screen issues.",
  "frontend/src/components/common/BulkUploadUX.tsx": "Provides reusable UI components for bulk upload workflows including steps display, helper text, template download button, validation button, and preview section with error/success alerts.",
  "frontend/src/components/common/DiagnosticsReportDialog.tsx": "Modal dialog that displays a formatted diagnostics report in a read-only textarea with options to copy to clipboard or clear the diagnostic log.",
  "frontend/src/components/common/ModalSelectContent.tsx": "Wrapper around SelectContent that ensures proper scrolling, z-index handling, and collision detection when dropdowns are used inside modal dialogs.",
  "frontend/src/components/common/QueryErrorState.tsx": "Reusable error display component for query failures with retry button, sign-in prompt for unauthorized errors, and collapsible technical details showing error messages and stack traces.",
  "frontend/src/components/common/SignInRequiredDialog.tsx": "Modal dialog prompting users to sign in with Internet Identity, featuring error handling, retry mechanism with attempt counter, and troubleshooting tips for authentication issues.",
  "frontend/src/components/common/SignInScreen.tsx": "Full-page sign-in screen with Internet Identity authentication, diagnostic information capture, domain-aware messaging for admin/staff portals, and detailed troubleshooting guidance for authentication failures.",
  "frontend/src/components/inventory/InventoryBulkUploadDialog.tsx": "Dialog for bulk uploading inventory items via CSV file with parsing validation, staff permission checks, error display, and integration with bulk create mutation to import multiple items at once.",
  "frontend/src/components/inventory/InventoryFormDialog.tsx": "Dialog form component for adding or editing inventory items with validation, mutation gating, authentication checks, and sign-in prompts on authorization failures.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component with header, sidebar navigation, and footer; conditionally renders admin/staff mode badges and access management links, and bypasses layout for print routes.",
  "frontend/src/components/payments/PaymentBulkUploadDialog.tsx": "Dialog for bulk uploading payments via CSV with template download, file parsing, validation, staff permission checks, and detailed success/failure reporting.",
  "frontend/src/components/payments/PaymentFormDialog.tsx": "Dialog form for adding individual payment records with fields for ID, date, client selection, payment mode, amount, reference number, and site.",
  "frontend/src/components/petty-cash/PettyCashAttachmentsSection.tsx": "Component for managing petty cash attachments (images and PDFs) with file upload validation, progress tracking, and removal functionality using backend blob storage.",
  "frontend/src/components/petty-cash/PettyCashBulkUploadDialog.tsx": "Dialog component for bulk uploading petty cash records via CSV file, with template download, validation, error reporting, and staff permission checks.",
  "frontend/src/components/petty-cash/PettyCashFormDialog.tsx": "Dialog form for creating/editing individual petty cash records with fields for balances, expenses, categories, attachments, and PDF generation capability.",
  "frontend/src/hooks/useAccessManagement.ts": "React Query hooks for admin-only access management: checking admin status, listing user approvals, and setting approval statuses.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance with authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useActorWithConnection.ts": "Enhanced actor hook with connectivity probing, bounded initialization timeouts, retry logic, and progressive connection state tracking for better UX.",
  "frontend/src/hooks/useAppMode.ts": "Hook to detect whether the app is running on admin or staff domain based on hostname pattern (presence of '-x18').",
  "frontend/src/hooks/useApprovalStatus.ts": "React Query hooks for checking caller approval/admin status and requesting approval, with automatic periodic refetching for real-time updates.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Mutation hook to bootstrap the first admin user on the admin domain, invalidating admin and approval queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication state.",
  "frontend/src/hooks/useMutationGate.ts": "Hook that gates mutations based on actor readiness and authentication state, returning detailed connection status and user-friendly error messages for UI feedback.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend operations including inventory, challans, payments, petty cash, clients, user profiles, and bulk operations with automatic cache invalidation.",
  "frontend/src/hooks/useQueryDataVersion.ts": "Helper hook that derives a serializable version string from React Query cache metadata to prevent BigInt serialization errors in queryKeys while maintaining reactivity.",
  "frontend/src/hooks/useStaffRestrictions.ts": "Hook combining hostname-based app mode and admin role checks to determine if users can perform bulk upload and delete actions, with disabled reason messages.",
  "frontend/src/hooks/useTodayKey.ts": "Hook returning a stable YYYY-MM-DD date key that automatically updates at midnight for triggering date-aware React Query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with OKLCH color system for light/dark themes and comprehensive Radix Dialog opacity fixes to ensure fully opaque modal backgrounds.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AccessManagementPage.tsx": "Admin-only page for managing user access approvals, displaying pending requests and approved users with approve/deny actions.",
  "frontend/src/pages/ChallanDetailPage.tsx": "Detail view page for individual challans showing items, totals, and actions (edit, delete, print) with returned challan locking and staff restrictions.",
  "frontend/src/pages/ChallanPrintPage.tsx": "Renders a print-optimized view of a single challan with header, client details, items table, and totals; auto-triggers browser print dialog after loading.",
  "frontend/src/pages/ChallansPage.tsx": "Displays a table of all challans with filtering, status badges, and actions (mark returned, print); includes dialogs for creating challans and bulk upload with staff permission checks.",
  "frontend/src/pages/ClientBalancesPage.tsx": "Shows a summary table of client balances including total rent, payments, outstanding amounts, and advances with color-coded formatting.",
  "frontend/src/pages/DashboardPage.tsx": "Displays dashboard metrics cards organized by daily, monthly, and all-time periods showing revenue, challans, payments, expenses, and inventory statistics.",
  "frontend/src/pages/InventoryPage.tsx": "Manages inventory items with a table view and dialogs for adding, editing, and bulk uploading items; includes authentication and staff permission checks.",
  "frontend/src/pages/PaymentsPage.tsx": "Lists all payment records in a table with date, client, mode badges, amount, and reference number; provides dialogs for adding payments and bulk upload with permission checks.",
  "frontend/src/pages/PettyCashPage.tsx": "React page component for managing petty cash records with table display, add/bulk upload dialogs, PDF export functionality, and staff permission checks.",
  "frontend/src/pages/ReportsPage.tsx": "React page component for generating and exporting reports with filtering by date range, client, site, and status across challans, payments, and petty cash data.",
  "frontend/src/utils/challanExportTemplate.ts": "Builds Excel export data for challans with item-level detail rows, repeating challan-level fields for each item and calculating totals.",
  "frontend/src/utils/challanImport.ts": "Parses legacy CSV format for challan imports with one row per item, validating headers, dates, and numeric fields, returning valid challans and errors.",
  "frontend/src/utils/challanImportNewFormat.ts": "Parses new CSV format for challan imports with multiple items per row using parentheses or colon notation, supporting item name extraction and validation.",
  "frontend/src/utils/challanRestoreImport.ts": "Parses CSV for restoring challan dates, supporting both legacy (Start/End Date) and new (Rent/Return Date) formats with validation.",
  "frontend/src/utils/challanTotals.ts": "Provides shared calculation utilities for challan totals, including item totals (quantity × rate × rental days), challan totals (items + freight), and form-based calculations for create/edit dialogs.",
  "frontend/src/utils/clientImport.ts": "Handles CSV parsing and validation for client imports, checking for required fields, duplicate names in existing data and within the upload file, and returning validated Client objects with errors.",
  "frontend/src/utils/csv.ts": "Robust CSV parser that handles standard quoting rules, escaped quotes, UTF-8 BOM, CRLF line endings, and multi-line quoted fields, returning headers and rows.",
  "frontend/src/utils/dashboardMetrics.ts": "Calculates dashboard metrics (revenue, payments, pending amounts, expenses, cash in hand) for given time periods, implementing revenue-day logic where only challans with rentDate ≤ today count toward revenue, and tracks future challans separately.",
  "frontend/src/utils/dates.ts": "Date utility functions for converting between JavaScript Date and backend bigint nanosecond timestamps, parsing date strings (YYYY-MM-DD and DD-MMM-YY formats), normalizing dates to start-of-day, calculating rental days, and formatting dates/currency.",
  "frontend/src/utils/diagnosticsReport.ts": "Generates diagnostics reports for troubleshooting authentication failures, collecting browser info, Internet Identity status, blank screen detection, popup blocker status, CSP/CORS issues, and error logs with formatting for text export.",
  "frontend/src/utils/errors.ts": "Classifies and normalizes errors into categories (actor-unavailable, authorization, validation, network, connection, timeout, unknown) with user-friendly messages and helper functions to check error types.",
  "frontend/src/utils/exportToCSV.ts": "Provides functions to download CSV templates for inventory, challans, payments, petty cash, and clients. Each function generates a CSV header row and triggers a browser download.",
  "frontend/src/utils/exportToExcel.ts": "Exports comprehensive financial reports to Excel format using SheetJS loaded from CDN. Generates multi-sheet workbooks with summary, challans, payments, petty cash, and client balances data.",
  "frontend/src/utils/paymentImport.ts": "Parses and validates payment CSV uploads, checking for required fields, duplicate IDs, valid dates and amounts. Returns validated Payment objects and detailed error messages for invalid rows.",
  "frontend/src/utils/pettyCashImport.ts": "Parses and validates petty cash CSV uploads, verifying dates, numeric fields, and category expenses format. Checks for duplicate dates and calculates net change and closing balance for each record.",
  "frontend/src/utils/pettyCashPdf.ts": "Generates PDF documents for petty cash records using pdf-lib loaded from CDN. Creates formatted A4 pages with tables showing opening balance, transactions, and closing balance.",
  "frontend/src/utils/reportExportFormatters.ts": "Provides shared formatting utilities for Excel exports including date conversion from nanoseconds, currency formatting to 2 decimals, and safe text normalization.",
  "frontend/src/utils/runtimeDiagnostics.ts": "Implements runtime diagnostics logging for tracking actor initialization, authentication lifecycle events, and errors. Persists diagnostic entries to sessionStorage with context like user agent, path, and auth status.",
  "frontend/src/utils/safeSerialize.ts": "Provides safe serialization utilities that handle BigInt values by converting them to strings, preventing JSON serialization errors when displaying technical details or error diagnostics.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended animations, border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata for RentIQ Udaipur describing a web app with Internet Identity authentication and admin approval system, currently tracking a critical bug where the Internet Identity authorization page displays a blank white screen."
}