{
  "backend/main.mo": "Motoko canister defining access control, approval, blob storage mixins, and data models for inventory, challans, payments, petty cash, and clients with admin/approval checks.",
  "feature_evidence.json": "Feature evidence report linking a frontend authentication update to specific files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing routing, pages, forms, and behavior changes.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment and verification guide detailing build steps, critical tests, diagnostics, and troubleshooting instructions.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry file setting up the root element and loading main.tsx.",
  "frontend/src/App.tsx": "Defines the router, initializes diagnostics, wraps routes in backend and auth gates, and sets up all application pages.",
  "frontend/src/components/challans/ChallanBulkUploadDialog.tsx": "Bulk challan upload dialog handling CSV parsing, validation, permission checks, and batch creation results.",
  "frontend/src/components/challans/ChallanEditDialog.tsx": "Dialog for editing an existing challan, loading initial values, validating inventory quantities, and submitting updates.",
  "frontend/src/components/challans/ChallanFormDialog.tsx": "Dialog for creating a new challan with form state, item list management, inventory validation, and submission.",
  "frontend/src/components/challans/ChallanNewFormatBulkUploadDialog.tsx": "Bulk challan uploader that parses a new-format CSV, validates entries, and submits them with permission checks.",
  "frontend/src/components/challans/ChallanRestoreDatesDialog.tsx": "Bulk restore dialog for resetting challan dates using a CSV file, including parsing, validation, and permission gating.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Bulk client upload dialog that parses a CSV, validates client names, and submits creation results with error reporting.",
  "frontend/src/components/common/AppErrorBoundary.tsx": "React error boundary that catches render failures and shows a diagnostic UI with expandable details and a copy-to-clipboard report.",
  "frontend/src/components/common/ApprovalRequiredScreen.tsx": "Full‑page screen for logged‑in but unapproved users to request access, view status, or sign out.",
  "frontend/src/components/common/AuthApprovalGate.tsx": "Global gate that blocks routes until the user is authenticated and approved or admin, with auto‑bootstrap on admin domains.",
  "frontend/src/components/common/BackendConnectionGate.tsx": "Connectivity gate that probes backend availability and shows progressive loading, errors, and retry options before rendering children.",
  "frontend/src/components/common/BuildInfo.tsx": "Build and runtime diagnostics panel showing connection status, backend metadata, logs, and retry tools.",
  "frontend/src/components/common/BulkUploadUX.tsx": "Provides reusable UI components for bulk upload workflows including steps, helper text, validation, template download, and preview sections showing valid items and errors.",
  "frontend/src/components/common/DiagnosticsReportDialog.tsx": "Dialog that displays diagnostics logs in a textarea with options to copy the report or clear the log.",
  "frontend/src/components/common/ModalSelectContent.tsx": "A wrapper for SelectContent that improves scrolling, collision handling, and interaction inside modal dialogs.",
  "frontend/src/components/common/QueryErrorState.tsx": "Reusable error display component with retry/sign-in actions and expandable technical error details.",
  "frontend/src/components/common/SignInRequiredDialog.tsx": "Dialog prompting the user to sign in via Internet Identity before performing restricted actions.",
  "frontend/src/components/common/SignInScreen.tsx": "Full-page sign-in screen guiding users through Internet Identity authentication with loading and error states.",
  "frontend/src/components/inventory/InventoryBulkUploadDialog.tsx": "Dialog for uploading inventory CSV files, parsing and validating rows, and submitting bulk creation requests with error reporting.",
  "frontend/src/components/inventory/InventoryFormDialog.tsx": "Form dialog for creating or editing inventory items with validation, mutation gating, and sign‑in prompts on authorization issues.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main application layout with header, sidebar navigation, footer, and conditional modes, hiding layout for print routes.",
  "frontend/src/components/payments/PaymentBulkUploadDialog.tsx": "Implements a dialog for CSV-based bulk payment upload with validation, permission checks, and result reporting.",
  "frontend/src/components/payments/PaymentFormDialog.tsx": "Provides a dialog form to manually add a payment, handling client selection, input validation, and submission.",
  "frontend/src/components/petty-cash/PettyCashAttachmentsSection.tsx": "Manages petty cash file attachments, supporting uploads, validation, previews, and removal via API hooks.",
  "frontend/src/components/petty-cash/PettyCashBulkUploadDialog.tsx": "Implements a CSV bulk upload dialog for petty cash records with validation, permission enforcement, and import results.",
  "frontend/src/components/petty-cash/PettyCashFormDialog.tsx": "Dialog component for creating or editing petty cash records, managing form state, categories, saving, and PDF generation.",
  "frontend/src/hooks/useAccessManagement.ts": "Hooks for admin access management, including checking admin status, listing approvals, setting approvals, and deriving pending/approved lists.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useActorWithConnection.ts": "Enhances actor initialization with connectivity probing, timeouts, retry logic, and detailed connection state tracking.",
  "frontend/src/hooks/useAppMode.ts": "Determines whether the app is running in admin or staff mode based on hostname patterns.",
  "frontend/src/hooks/useApprovalStatus.ts": "Hooks for checking approval/admin status and requesting approval, with periodic refetching for status updates.",
  "frontend/src/hooks/useBootstrapAdmin.ts": "Mutation hook to bootstrap the first admin user and refresh related approval queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity loading via AuthClient.",
  "frontend/src/hooks/useMutationGate.ts": "Gates mutations based on actor readiness, connection state, and authentication, returning reasons when actions are blocked.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for inventory, challans, and related CRUD operations using an actor backend.",
  "frontend/src/hooks/useQueryDataVersion.ts": "Provides a hook that exposes a serializable version string based on React Query cache update timestamps.",
  "frontend/src/hooks/useStaffRestrictions.ts": "Determines whether a user can perform bulk upload or delete actions based on app mode and admin status.",
  "frontend/src/hooks/useTodayKey.ts": "Returns a date-based key that updates at midnight to trigger recalculations in dependent queries.",
  "frontend/src/index.css": "Sets global Tailwind styles, theme variables, and overrides Radix Dialog components for consistent opaque rendering.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and Internet Identity providers, then renders the root component.",
  "frontend/src/pages/AccessManagementPage.tsx": "Admin-only page for viewing, approving, and rejecting user access requests with loading and permission handling.",
  "frontend/src/pages/ChallanDetailPage.tsx": "Displays details for a specific challan with options to edit, print, or delete based on staff restrictions.",
  "frontend/src/pages/ChallanPrintPage.tsx": "Renders a print-ready challan view and auto-triggers printing once data is loaded.",
  "frontend/src/pages/ChallansPage.tsx": "Displays and manages challans with actions for creation, uploads, restoring dates, and marking returned, respecting authentication and staff restrictions.",
  "frontend/src/pages/ClientBalancesPage.tsx": "Shows a table of client balances including rent, payments, outstanding amounts, and advances with loading and empty states.",
  "frontend/src/pages/DashboardPage.tsx": "Renders daily, monthly, and all‑time business metrics using inventory and dashboard data with formatted statistics.",
  "frontend/src/pages/InventoryPage.tsx": "Lists inventory items and supports adding, editing, and bulk uploading items with permission checks and dialogs.",
  "frontend/src/pages/PaymentsPage.tsx": "Displays payment records with mode badges and supports adding and bulk uploading payments, handling errors and loading states.",
  "frontend/src/pages/PettyCashPage.tsx": "Shows petty cash records with totals and PDF generation, allowing adding and bulk uploading entries under staff restrictions.",
  "frontend/src/pages/ReportsPage.tsx": "React page for generating filtered financial reports, handling date ranges, clients, sites, and exporting to Excel.",
  "frontend/src/utils/challanExportTemplate.ts": "Builds challan worksheet rows for Excel export with item-level detail and formatted totals.",
  "frontend/src/utils/challanImport.ts": "Parses legacy challan CSV files, validating rows and converting them into Challan objects while collecting errors.",
  "frontend/src/utils/challanImportNewFormat.ts": "Parses new-format challan CSV files, supporting multiple item syntaxes and generating validated Challan objects.",
  "frontend/src/utils/challanRestoreImport.ts": "Parses restore CSVs for challan date correction, supporting both legacy and new date formats.",
  "frontend/src/utils/challanTotals.ts": "Utilities for calculating challan totals, item totals, and form totals consistently.",
  "frontend/src/utils/clientImport.ts": "Parses and validates client CSV uploads, checking for duplicates and generating new Client objects.",
  "frontend/src/utils/csv.ts": "Parses CSV text with proper quoting, BOM stripping, line normalization, and multiline field handling.",
  "frontend/src/utils/dashboardMetrics.ts": "Calculates dashboard revenue and payment metrics for given periods and computes future challan stats.",
  "frontend/src/utils/dates.ts": "Provides date↔nanosecond conversions, normalization, parsing, comparisons, and common date helpers.",
  "frontend/src/utils/diagnosticsReport.ts": "Generates structured diagnostics data and formats or copies a text report from runtime logs.",
  "frontend/src/utils/errors.ts": "Normalizes and classifies errors into categories like authorization, validation, and network.",
  "frontend/src/utils/exportToCSV.ts": "Creates and downloads various CSV templates (inventory, challan, payment, petty cash, clients).",
  "frontend/src/utils/exportToExcel.ts": "Builds an Excel workbook with summary, challans, payments, petty cash, and client balance sheets using SheetJS.",
  "frontend/src/utils/paymentImport.ts": "Parses CSV into payment rows and validates IDs, dates, and numeric fields to produce Payment objects or errors.",
  "frontend/src/utils/pettyCashImport.ts": "Parses and validates petty cash CSV rows, checking headers, dates, duplicates, and numeric values before constructing PettyCash records.",
  "frontend/src/utils/pettyCashPdf.ts": "Generates a petty cash PDF using pdf-lib, rendering record details in a formatted table layout.",
  "frontend/src/utils/reportExportFormatters.ts": "Provides shared helpers for formatting dates, currency, and text for Excel-style report exports.",
  "frontend/src/utils/runtimeDiagnostics.ts": "Captures runtime errors and actor lifecycle events with context, storing a capped diagnostics log in sessionStorage.",
  "frontend/src/utils/safeSerialize.ts": "Offers BigInt‑safe serialization and error formatting utilities to avoid JSON stringify failures.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and removing URL parameters with sessionStorage fallback for routing contexts.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugins for typography, container queries, and animation.",
  "project_state.json": "Project state file detailing admin-role feature requests, existing issues, and architectural notes for permission/approval logic."
}